Repository: mozilla-l10n/mt-training-data
Catalog: am/am_pontoon.tmx
Source language: en_us
Languages: am

source: Available in over 90 languages, and compatible with { -brand-name-windows }, { -brand-name-mac-short } and { -brand-name-linux } machines, { -brand-name-firefox } works no matter what you’re using or where you are. Make sure your operating system is up to date for the best experience.
am: ከ90 በላይ ቋንቋዎች ላይ የሚገኝ፣ እንዲሁም ከ{ -brand-name-windows }፣ { -brand-name-mac-short } እና { -brand-name-linux } ማሽኖች፣ { -brand-name-firefox } ጋር ያለምንም ችግር ምንም ቢጠቀሙ ወይም የትም ቢሆኑ ይሰራል። ለተሻለ ልምድ የእርስዎ ስርዓተ ክወና ወቅታዊ መሆኑን ያረጋግጡ።

source: A web browser takes you anywhere on the internet, letting you see text, images and video from anywhere in the world.
am: የድር አሳሽ በይነመረብ ላይ ወደ የትኛውም ቦታ ይወስድዎታል፣ ይህም ጽሑፍን፣ ምስሎችን እና ተንቀሳቃሽ ምስሎችን ከየትኛውም የዓለም ክፍል እንዲያዩ ያስችልዎታል።

source: Backed by the <strong>non-profit</strong> that puts people first
am: ሰዎችን በማስቀደም በ<strong>ትርፍ ያልሆነ</strong> የተደገፈ

source: Back to home page
am: ወደ መነሻ ገጽ ተመለስ

source: Be among the first to explore future releases of { -brand-name-firefox } for desktop, { -brand-name-android } and { -brand-name-ios }.
am: የወደፊት የ{ -brand-name-firefox } ለዴስክቶፕ፣ { -brand-name-android } እና { -brand-name-ios } ልቀቶችን ለማሰስ የመጀመሪያዎቹ ይሁኑ።

source: Before Web Era
am: ከድር ዘመን በፊት

source: Be the master of your domain with strict content blocking. Cut off all cookies and trackers.
am: በጥብቅ የይዘት እገዳ የጎራዎ አዛዥ ይሁኑ። ሁሉንም ኩኪዎች እና መከታተያዎች ይቁረጡ።

source: Block Autoplay of video & audio
am: ተንቀሳቃሽ ምስል እና ድምፅን በራስ-ማጫወት አግድ

source: Block trackers
am: መከታተያዎችን አግድ

source: Bookmark, history and open tab in results
am: በውጤቶች ውስጥ ዕልባት ፣ ታሪክ እና ትርን ይክፈቱ

source: Bookmarks manager
am: የዕልባቶች አስተዳዳሪ

source: Boost your productivity
am: ምርታማነትዎን ያሳድጉ

source: { -brand-name-android } { -brand-name-nightly } and { -brand-name-beta }
am: { -brand-name-android } { -brand-name-nightly } እና { -brand-name-beta }

source: { -brand-name-beta } is an unstable testing and development platform. By default, { -brand-name-beta } sends data to { -brand-name-mozilla } — and sometimes our partners — to help us handle problems and try ideas. <a href="{ $link }">Learn what is shared</a>.
am: { -brand-name-beta } ያልተረጋጋ የሙከራ እና በመበልፀግ ላይ ያለ መድረክ ነው። በነባሪ { -brand-name-beta } ችግሮችን እንድንፈታ እና ሀሳቦችን እንድንሞክር ለማገዝ ወደ { -brand-name-mozilla } — እና አንዳንዴም ወደ አጋሮቻችን — ውሂብ ይልካል። <a href="{ $link }">ምን እንደተጋራ ይወቁ</a>።

source: { -brand-name-developer-edition } is an unstable testing and development platform. By default, { -brand-name-developer-edition } sends data to { -brand-name-mozilla } — and sometimes our partners — to help us handle problems and try ideas. <a href="{ $link }">Learn what is shared</a>.
am: { -brand-name-developer-edition } ያልተረጋጋ የሙከራ እና በመበልፀግ ላይ ያለ መድረክ ነው። በነባሪ { -brand-name-developer-edition }ችግሮችን እንድንፈታ እና ሀሳቦችን እንድንሞክር ለማገዝ ወደ { -brand-name-mozilla } — እና አንዳንዴም ወደ አጋሮቻችን — ውሂብ ይልካል። <a href="{ $link }">ምን እንደተጋራ ይወቁ</a>።

source: { -brand-name-enterprise } packages
am: { -brand-name-enterprise } ጥቅሎች

source: { -brand-name-firefox } automatically <a { $attrs }>blocks many third party trackers</a> from collecting and selling your web activity.
am: { -brand-name-firefox } በራስ ሰር <a { $attrs }>ብዙ የሶስተኛ ወገን መከታተያዎች</a> የድር እንቅስቃሴዎን እንዳይሰበስቡ እና እንዳይሸጡ ያግዳል።

source: { -brand-name-firefox-beta } automatically sends feedback to { -brand-name-mozilla }.
am: { -brand-name-firefox-beta } በራስ ሰር ወደ { -brand-name-mozilla } ግብረ መልስ ይልካል።

source: { -brand-name-firefox } browser for { -brand-name-android } is fast, secure and private from the first time you open it.
am: { -brand-name-firefox } የ{ -brand-name-android } አሳሽ ለመጀመሪያ ጊዜ ከከፈቱት ጊዜ ጀምሮ ፈጣን፣ ደህንነቱ የተጠበቀ እና ሚስጥራዊ ነው።

source: { -brand-name-firefox-browser } for { -brand-name-chromebook }
am: { -brand-name-firefox-browser } ለ{ -brand-name-chromebook }

source: { -brand-name-firefox-browser } is a free web browser with fast page loading, less memory usage, and lots of features - a project of the not-for-profit { -brand-name-mozilla }.
am: { -brand-name-firefox-browser } ፈጣን ገጽ መጫን፣ አነስተኛ ማህደረ ትውስታ አጠቃቀም እና ብዙ ባህሪያት ያለው ነፃ የድር አሳሽ ሲሆን - ለትርፍ ያልተቋቋመው የ{ -brand-name-mozilla } ፕሮጀክት ነው ።

source: { -brand-name-firefox-browser } - MSI installer
am: { -brand-name-firefox-browser } - MSI ጫኚ

source: { -brand-name-firefox-browser } support
am: { -brand-name-firefox-browser } ድጋፍ

source: { -brand-name-firefox-developer-edition } automatically sends feedback to { -brand-name-mozilla }.
am: { -brand-name-firefox-developer-edition } በራስ ሰር ወደ { -brand-name-mozilla } ግብረ መልስ ይልካል።

source: { -brand-name-firefox } doesn’t spy on searches. We stop known third-party tracking cookies and give you full control.
am: { -brand-name-firefox } ፍለጋዎችን አይሰልል። የታወቁ የሶስተኛ ወገን መከታተያ ኩኪዎችን አቁመን ሙሉ ቁጥጥር እንሰጥዎታለን።

source: { -brand-name-firefox } doesn’t spy on searches. We stop third-party tracking cookies and give you full control.
am: { -brand-name-firefox } ፍለጋዎችን አይሰልልም። የሶስተኛ ወገን መከታተያ ኩኪዎችን እናስቆም እና ሙሉ ቁጥጥር እንሰጥዎታለን።

source: { -brand-name-firefox-extended-support-release } ({ -brand-name-esr }) - MSI installer
am: { -brand-name-firefox-extended-support-release }({ -brand-name-esr })- MSI ጫኚ

source: { -brand-name-firefox } FAQ
am: { -brand-name-firefox } ተደጋጋሚ ጥያቄዎች

source: { -brand-name-firefox } fights for you on Windows
am: { -brand-name-firefox } በ{ -brand-name-windows } ላይ ለእርስዎ ይታገላል

source: { -brand-name-firefox-focus } is available for both { -brand-name-ios } and { -brand-name-android } devices.
am: { -brand-name-firefox-focus } ለሁለቱም የ{ -brand-name-ios } እና { -brand-name-android } መሳሪያዎች ይገኛል።

source: { -brand-name-firefox-focus } is your dedicated privacy browser with automatic tracking protection.
am: { -brand-name-firefox-focus } በራስ-ሰር የመከታተያ ጥበቃ ያለው የእርስዎ የግላዊነት አሳሽ ነው።

source: { -brand-name-firefox-focus }: The privacy browser
am: { -brand-name-firefox-focus }፡ የግላዊነት አሳሽ

source: { -brand-name-firefox } for { -brand-name-android }
am: { -brand-name-firefox } ለ { -brand-name-android }

source: { -brand-name-firefox } for { -brand-name-ios }
am: { -brand-name-firefox } ለ { -brand-name-ios }

source: { -brand-name-firefox } for { -brand-name-linux }
am: { -brand-name-firefox } ለ { -brand-name-linux }

source: { -brand-name-firefox } for { -brand-name-windows } 64-bit
am: { -brand-name-firefox } ለ{ -brand-name-windows } 64-ቢት

source: { -brand-name-firefox } for Desktop
am: { -brand-name-firefox } ለዴስክቶፕ

source: { -brand-name-firefox } has been there since almost the beginning.
am: { -brand-name-firefox } ገና ከመጀመሪያው ጀምሮ የነበረ ማለት ይቻላል።

source: { -brand-name-firefox } helps you be more private online by letting you block trackers from following you around the web.
am: { -brand-name-firefox } መከታተያዎች በድር ላይ እንዳይከተሉዎት በማገድ በመስመር ላይ የበለጠ ግላዊ እንዲሆኑ ያግዝዎታል።

source: { -brand-name-firefox } is for everyone
am: { -brand-name-firefox } ለሁሉም ነው

source: { -brand-name-firefox } is more than a browser.
am: { -brand-name-firefox } ከአሳሽም በላይ ነው።

source: { -brand-name-firefox } mobile adapts to you and makes it easier than ever to see all your open tabs, past searches and favorite sites.
am: { -brand-name-firefox } ለስልክ ከእርስዎ ጋር ይስማማል እና ሁሉንም ክፍት ትሮችዎን ፣ ያለፉ ፍለጋዎችዎን እና ተወዳጅ ድረ-ገጾችዎን ለማየት ከመቼውም ጊዜ በበለጠ ቀላል ያደርገዋል።

source: { -brand-name-firefox } mobile browsers put your privacy first
am: { -brand-name-firefox } የተንቀሳቃሽ ስልክ አሳሾች የእርስዎን ግላዊነት ያስቀድማሉ

source: { -brand-name-firefox } moves fast and treats your data with care - no ad tracking and no slowdown.
am: { -brand-name-firefox } በፍጥነት ይንቀሳቀሳል እንዲሁም ውሂብዎን በጥንቃቄ ያስተናግዳል - ምንም የማስታወቂያ ክትትል እና መጓተት የለም።

source: { -brand-name-firefox-nightly } automatically sends feedback to { -brand-name-mozilla }.
am: { -brand-name-firefox-nightly } በራስ ሰር ወደ { -brand-name-mozilla } ግብረ መልስ ይልካል።

source: { -brand-name-firefox } Privacy
am: { -brand-name-firefox } ግላዊነት

source: { -brand-name-firefox } Privacy Notice
am: { -brand-name-firefox } የግላዊነት ማስታወቂያ

source: { -brand-name-firefox }: Private, Safe Browser
am: { -brand-name-firefox }፡ የግል፣ ደህንነቱ የተጠበቀ አሳሽ

source: { -brand-name-firefox } products are designed to protect your privacy
am: { -brand-name-firefox } ምርቶች የእርስዎን ግላዊነት ለመጠበቅ የተነደፉ ናቸው

source: { -brand-name-firefox } respects your privacy on { -brand-name-mac-short }.
am: { -brand-name-firefox } በ{ -brand-name-mac-short } ላይ የእርስዎን ግላዊነት ያከብራል።

source: { -brand-name-firefox } was created by <a { $attrs }>{ -brand-name-mozilla }</a> as a faster, more private alternative to browsers like { -brand-name-ie }, and now { -brand-name-chrome }. Today, our mission-driven company and volunteer community continue to put your privacy above all else.
am: { -brand-name-firefox } የተፈጠረው በ<a { $attrs }>{ -brand-name-mozilla }</a> እንደ ፈጣን እና የበለጠ የግል አሳሾች እንደ { -brand-name-ie }፣ እና አሁን { -brand-name-chrome }። ዛሬ፣ በተልዕኮ የሚመራ ኩባንያችን እና የበጎ ፈቃደኞች ማህበረሰቦች የእርስዎን ግላዊነት ከምንም በላይ ማስቀደማቸውን ቀጥለዋል።

source: { -brand-name-nightly } and { -brand-name-beta }
am: { -brand-name-nightly } እና { -brand-name-beta }

source: { -brand-name-nightly } Blog
am: { -brand-name-nightly } ጦማር

source: { -brand-name-nightly } is an unstable testing and development platform. By default, { -brand-name-nightly } sends data to { -brand-name-mozilla } — and sometimes our partners — to help us handle problems and try ideas. <a href="{ $link }">Learn what is shared</a>.
am: { -brand-name-nightly } ያልተረጋጋ የሙከራ እና በስሪት ያለ መድረክ ነው። በነባሪ { -brand-name-nightly } ችግሮችን እንድንቋቋም እና ሀሳቦችን እንድንሞክር ለማገዝ ወደ { -brand-name-mozilla } — እና አንዳንዴም ወደ አጋሮቻችን — ውሂብ ይልካል። <a href="{ $link }">ምን እንደተጋራ ይወቁ</a>።

source: { -brand-name-windows } 32-bit
am: 32-ቢት { -brand-name-windows }

source: { -brand-name-windows } 64-bit
am: 64-ቢት { -brand-name-windows }

source: Breached website alerts
am: የተደፈሩ የድር ጣቢያ ማንቂያዎች

source: Browser History: Epic power struggles that brought us modern browsers
am: የአሳሽ ታሪክ፡ ዘመናዊ አሳሾችን ያመጣን ዝርዝር የሃይል ትግል

source: Browsing the Web Today
am: ዛሬ ድሩን ማሰስ

source: Build and Perfect your sites<br> with { -brand-name-firefox-devtools }
am: ድረ-ገፆችዎን ይገንቡ እና ያሟሉ<br> በ{ -brand-name-firefox-devtools }

source: Build, test, scale and more with the only browser built just for developers.
am: ይስሩ ይሞክሩ ያመዛዝኑ እና ሌሎችም ይሄ ሁሉ በአንድ አሳሽ ለዴቬሎፐር ተብሎ የተሰራ

source: Built for Developers
am: ለገንቢዎች የተሰራ

source: Built-in password manager
am: አብሮ የተሰራ የይለፍ ቃል አስተዳዳሪ

source: Built-in screenshot tool
am: አብሮ የተሰራ ቅጽበታዊ ገጽ እይታ መሣሪያ

source: By proceeding, you agree to the <a href="{ $url1 }">Terms of Service</a> and <a href="{ $url2 }">Privacy Notice</a>.
am: በመቀጠል፣ በ<a href="{ $url1 }">የአገልግሎት ውል</a> እና <a href="{ $url2 }">የግላዊነት ማስታወቂያ</a> ተስማምተዋል።

source: Challenging the status quo since 1998
am: ከ 1998 ጀምሮ ያለውን ታዋቂ ሁኔታ በመታገል ላይ

source: Change new tab layout
am: አዲስ የትር አቀማመጥ ቀይር

source: Change up your look
am: መልክዎን ይቀይሩ

source: { $channel_name } is <a href="{ $help_url }">no longer supported</a> on { $os_version } and below.
am: { $channel_name } በ{ $os_version } እና በታች ላይ <a href="{ $help_url }">ከአሁን በኋላ አይደገፍም</a>።

source: Check out new { -brand-name-android } features in their earliest stages. Enjoy at your own risk.
am: አዲስ የ{ -brand-name-android } ባህሪያትን በመጀመሪያ ደረጃቸው ይመልከቱ። በራስዎ ኃላፊነት ይደሰቱ።

source: Check the system requirements
am: የአሰራር ስርዓቱ የሚፈልገውን ያረጋግጡ

source: Check your device for the email!
am: ለኢሜይሉ መሳሪያዎን ይፈትሹ!

source: Choose a 32-bit installer for computers with 32-bit processors — or for older or less powerful computers. <a href="{ $url }">If you aren’t sure</a> whether to choose a 64-bit or 32-bit installer, we recommend you go with 32-bit.
am: ባለ 32-ቢት ማቀናጃን ለባለ 32-ቢት መከወኛ ኮምፒውተሮች - ወይም ለቀድሞዎቹ እና አነስተኛ አቅም ላላቸው ኮምፒውተሮች ይምረጡ። <a href="{ $url }">እርግጠኛ ካልሆኑ ግን</a> ባለ 64-ቢት ወይስ ባለ 32-ቢት ማቀናጃ እንደሚሻልዎት፤ ባለ 32-ቢት ቢጠቀሙ የተሻለ ነው።

source: Choose a 64-bit installer for computers with 64-bit processors, which allow them to allocate more RAM to individual programs — particularly important for games and other demanding applications.
am: ባለ 64-ቢት ማቀናጃን ለባለ 64-ቢት መከወኛ ይምረጡ፣ ይኼም እያንዳንዱ ኘሮግራም ተጨማሪ RAM መጠቀም እንዲችል ይረዳል - በተለይ ለጨዋታ እና ይኼን ለሚፈልጉ መተግበሪያዎች ይጠቅማል።

source: Choose automatic privacy
am: ራስ-ሰር ግላዊነትን ይምረጡ

source: Choose corporate independence
am: የድርጅት ነፃነትን ይምረጡ

source: Choose freedom on every device
am: በእያንዳንዱ መሳሪያ ላይ ነፃነትን ይምረጡ

source: Choose the browser that protects your privacy. Set { -brand-name-firefox } as your default browser.
am: የእርስዎን ግላዊነት የሚጠብቅ አሳሽ ይምረጡ። { -brand-name-firefox }ን እንደ ነባሪ አሳሽዎ ያቀናብሩ።

source: Choose which { -brand-name-firefox-browser } to download in your language
am: በራስዋ ቋንቋ የፈለጉትን አይነት { -brand-name-firefox-browser } ለመጫን ይምረጡ

source: Choose your level of protection
am: የመከላከያዎን ደረጃ ይምረጡ

source: Choosing the best browser for you is a lot like choosing a home. You want to explore your options, do some research and make a decision based on what’s important to you.
am: የተሻለ ድረ-ገፅ ማሰሻን መምረጥ ለርስዎ ልክ መኖሪያ ቤት እንደመምረጥ ነው። የሚፈልጉትን ነገር ዘርዝረው የተወሰነ ጥናት ካደረጉ በኋላ፤ የሚጠቅምዎትን ለመምረጥ ውሳኔ ላይ ይድረሱ።

source: Chrome OS
am: ክሮም OS

source: Clear history
am: ታሪክ አጽዳ

source: Common sense privacy
am: የተለመደ ግላዊነት

source: Compare
am: አወዳድር

source: Compare Browsers
am: አሳሾችን አወዳድር

source: Console
am: መስሪያ

source: Cookies (not the yummy kind)
am: ኩኪዎች (የሚጣፍጥ ዓይነት አይደለም)

source: Count on stability and ease of use with this { -brand-name-firefox } browser built for enterprise.
am: ለድርጅት ታስቦ በተሰራው በዚህ { -brand-name-firefox } አሳሽ ጥንካሬ እና የአጠቃቀም ቀላልነት ላይ ይተማመኑ።

source: Cover your trail, block trackers
am: ዱካዎን ይሸፍኑ ፣ መከታተያዎችን ያግዱ

source: Create a tracker-free zone with Content Blocking
am: በይዘት ማገድ ጋር በመሆን ከመከታተያ-ነፃ ዞን ይፍጠሩ

source: Cryptominer Blocking
am: ምናባዊ ገንዘብ ቆፋሪን ማገድ

source: Curated content on new tab
am: በአዲስ ትር ላይ የተመረጠ ይዘት

source: Customize your browser
am: አሳሽዎን ያበጁ

source: Dark mode
am: ጨለማ ሁነታ

source: Delete your history
am: ታሪክህን ሰርዝ

source: Deployment guide
am: የትግበራ መመሪያ

source: Design. Code. Test. Refine.
am: ንድፍ። ኮድ። ሙከራ። ማሻሻል።

source: Desktop
am: ዴስክቶፕ

source: Desktop { -brand-name-beta } & { -brand-name-developer-edition }
am: ዴስክቶፕ { -brand-name-beta } እና { -brand-name-developer-edition }

source: Desktop { -brand-name-nightly }
am: ዴስክቶፕ { -brand-name-nightly }

source: Discover more of what you love
am: የሚወዱትን የበለጠ ያግኙ

source: Documentation and Community Support
am: ሰነዶች እና የማህበረሰብ ድጋፍ

source: Does { -brand-name-firefox } have a built-in VPN?
am: { -brand-name-firefox } አብሮ የተሰራ VPN አለው?

source: Does { -brand-name-firefox } use { -brand-name-google }?
am: { -brand-name-firefox } { -brand-name-google }ን ይጠቀማል?

source: Do it <strong>all</strong> with { -brand-name-firefox }
am: በ{ -brand-name-firefox } <strong>ሁሉንም</strong> ያድርጉት

source: Do-it-yourself Custom mode
am: ራስዎ ያድርጉት ብጁ ሞድ

source: Do what you do online.<br> { -brand-name-firefox-browser } <strong>isn’t</strong> watching.
am: በመስመር ላይ የሚያደርጉትን ያድርጉ።<br> { -brand-name-firefox-browser } <strong>አያይም</strong>።

source: Download a different build
am: የተለየ ግንባታ ያውርዱ

source: Download a different platform or language
am: የተለየ መድረክ ወይም ቋንቋ ያውርዱ

source: Download and test future releases of { -brand-name-firefox } for desktop, { -brand-name-android } and { -brand-name-ios }.
am: ወደፊት የሚለቀቀውን { -brand-name-firefox }ን ለዴስክቶፕ፣ { -brand-name-android } እና { -brand-name-ios } ያውርዱ እና ይሞክሩ።

source: Download and test the latest { -brand-name-firefox } for desktop features with { -brand-name-developer-edition }, { -brand-name-beta } and { -brand-name-nightly } builds.
am: ለዴስክቶፕ ባህሪያት በ{ -brand-name-developer-edition }፣ { -brand-name-beta } እና { -brand-name-nightly } የቅርብ ጊዜ ስሪቶችን { -brand-name-firefox } ያውርዱ እና ይሞክሩት።

source: Download { -brand-name-firefox }
am: { -brand-name-firefox }ን አውርድ

source: Download { -brand-name-firefox-browser }
am: { -brand-name-firefox-browser }ን አውርድ

source: Download { -brand-name-firefox-browser } — Fast, Private & Free — from { -brand-name-mozilla }
am: አውርድ { -brand-name-firefox-browser } — ፈጣን፣ የግል እና ነጻ — ከ{ -brand-name-mozilla }

source: Download { -brand-name-firefox-esr }
am: { -brand-name-firefox-esr }ን አውርድ

source: Download { -brand-name-firefox-esr } 32-bit
am: { -brand-name-firefox-esr } 32-ቢት አውርድ

source: Download { -brand-name-firefox-esr } 64-bit
am: { -brand-name-firefox-esr } 64-ቢት አውርድ

source: Download { -brand-name-firefox } for Desktop — from { -brand-name-mozilla }
am: አውርድ { -brand-name-firefox } ለዴስክቶፕ — ከ{ -brand-name-mozilla }

source: Download { -brand-name-mozilla } { -brand-name-firefox } for { -brand-name-linux }
am: { -brand-name-mozilla } { -brand-name-firefox }ን ለ { -brand-name-linux } አውርድ

source: Download { -brand-name-mozilla } { -brand-name-firefox } for { -brand-name-linux }, a free web browser. { -brand-name-firefox } is created by a global not-for-profit dedicated to putting individuals in control online. Get { -brand-name-firefox } for { -brand-name-linux } today!
am: ለ{ -brand-name-linux }፣ ነጻ የድር አሳሽ { -brand-name-mozilla } { -brand-name-firefox }ን አውርድ። { -brand-name-firefox } ግለሰቦች በመስመር ላይ ያላቸውን እንቅስቃሴ እንዲቆጣጠሩ ሆኖ በአለምአቀፍ ለትርፍ ያልተቋቋመ ድርጅት የተፈጠረ ነው። ለ{ -brand-name-linux } ዛሬውኑ { -brand-name-firefox }ን ያግኙ!

source: Download { -brand-name-mozilla } { -brand-name-firefox } for { -brand-name-mac-short }
am: ለ { -brand-name-mac-short } { -brand-name-mozilla } { -brand-name-firefox }ን አውርድ

source: Download { -brand-name-mozilla } { -brand-name-firefox } for { -brand-name-mac-short }, a free web browser. { -brand-name-firefox } is created by a global not-for-profit dedicated to putting individuals in control online. Get { -brand-name-firefox } for { -brand-name-mac-short } today!
am: ለ{ -brand-name-mac-short } { -brand-name-mozilla } { -brand-name-firefox }ን ነጻ የድር አሳሽ አውርድ። { -brand-name-firefox } ግለሰቦች የመስመር ላይ እንቅስቃሴያቸውን እንዲቆጣጠሩ ታስቦ፣ ለትርፍ ባልተቋቋመ አለምአቀፍ ድርጅት የተፈጠረ ነው። ዛሬውኑ { -brand-name-firefox }ን ለ{ -brand-name-mac-short } ያግኙ!

source: Download { -brand-name-mozilla } { -brand-name-firefox } for { -brand-name-windows }
am: ለ { -brand-name-windows } { -brand-name-mozilla } { -brand-name-firefox }ን አውርድ

source: Download { -brand-name-mozilla } { -brand-name-firefox } for { -brand-name-windows }, a free web browser. { -brand-name-firefox } is created by a global not-for-profit dedicated to putting individuals in control online. Get { -brand-name-firefox } for { -brand-name-windows } today!
am: ለ{ -brand-name-windows } { -brand-name-mozilla } { -brand-name-firefox } ነጻ የድር አሳሽ አውርድ። { -brand-name-firefox } ግለሰቦች የመስመር ላይ እንቅስቃሴያቸውን እንዲቆጣጠሩ ለማስቻል ለትርፍ ባልተቋቋመ ዓለም-አቀፍ ድረጅት የተፈጠረ ነው። ዛሬውኑ ለ{ -brand-name-windows } { -brand-name-firefox }ን ያግኙ!

source: Download for Desktop
am: ለዴስክቶፕ አውርድ

source: Download in another language
am: በሌላ ቋንቋ ያውርዱ

source: Download in another language or for another operating system.
am: በሌላ ቋንቋ ወይም ለሌላ ስርዓተ ክወና አውርድ።

source: Download Now
am: አሁን ጫን

source: Download on the { -brand-name-app-store }
am: በ{ -brand-name-app-store } ላይ ያውርዱ

source: Download options and other languages
am: አማራጮችን እና ሌሎች ቋንቋዎችን አውርድ

source: Download the app
am: መተግበሪያውን ያውርዱ

source: Download the { -brand-name-firefox } browser made for developers
am: ለገንቢዎች የተሰራውን { -brand-name-firefox } አሳሽ ያውርዱ

source: Download the { -brand-name-firefox } mobile browser for automatic protection on all your devices.
am: በሁሉም መሳሪያዎችዎ ላይ ለራስ-ሰር ጥበቃ { -brand-name-firefox } የስልክ አሳሽ ያውርዱ።

source: Download the fastest { -brand-name-firefox } ever
am: ከመቼውም ጊዜ ፈጣኑን { -brand-name-firefox } አውርድ

source: Download the fastest { -brand-name-firefox } for { -brand-name-linux } ever
am: የምንግዜም ፈጣኑን { -brand-name-firefox } ለ { -brand-name-linux } አውርድ

source: Download the fastest { -brand-name-firefox } for { -brand-name-mac-short } ever
am: ለ{ -brand-name-mac-short } የምንግዜም በጣም ፈጣኑን { -brand-name-firefox } ያውርዱ

source: Download the fastest { -brand-name-firefox } for { -brand-name-windows } ever
am: ለ{ -brand-name-windows } የምንግዜም በጣም ፈጣኑን { -brand-name-firefox } ያውርዱ

source: Easily organize your tabs
am: ትሮችዎን በቀላሉ ያደራጁ

source: Easy migration of preferences and bookmarks when you download { -brand-name-firefox } for { -brand-name-windows }.
am: { -brand-name-firefox }ን ለ{ -brand-name-windows } ሲያወርዱ ቀላል የምርጫዎች እና የእልባቶች ዝውውር።

source: Easy migration of preferences and bookmarks when you download { -brand-name-firefox } for Windows.
am: { -brand-name-firefox }ን ለ{ -brand-name-windows } ሲያወርዱ ቀላል የምርጫዎች እና የእልባቶች ዝውውር።

source: Email address
am: የኢሜል አድራሻ

source: Enhanced Tracking Protection (ETP)
am: የተሻሻለ የክትትል ጥበቃ (ኢቲፒ)

source: Experience cutting-edge browser features in pre-release versions: { -brand-name-firefox-developer-edition }, { -brand-name-firefox-beta } and { -brand-name-firefox-nightly }. Download now!
am: በቅድመ-መለቀቅ ስሪቶች ውስጥ በጣም ጥሩ የአሳሽ ባህሪያትን ይለማመዱ፡{ -brand-name-firefox-developer-edition }፣ { -brand-name-firefox-beta } እና { -brand-name-firefox-nightly }። አሁኑኑ አውርድ!

source: Experience cutting-edge features in a pre-release browser for { -brand-name-android }: { -brand-name-firefox-beta } and { -brand-name-firefox-nightly }. Install now!
am: ለ{ -brand-name-android }፡ { -brand-name-firefox-beta } እና { -brand-name-firefox-nightly } በቅድመ-ልቀት አሳሽ ውስጥ ማራኪ ባህሪያትን ይለማመዱ። አሁን ጫን!

source: Experience cutting-edge features in a pre-release browser for { -brand-name-android }: { -brand-name-firefox-beta }, { -brand-name-firefox-aurora } and { -brand-name-firefox-nightly }. Install now!
am: ለ{ -brand-name-android }፡ { -brand-name-firefox-beta }፣ { -brand-name-firefox-aurora } እና { -brand-name-firefox-nightly } በቅድመ-ልቀት አሳሽ ውስጥ ማራኪ ባህሪያትን ተለማመዱ። አሁን ጫን!

source: Experience cutting-edge features in a pre-release browser for { -brand-name-ios } via { -brand-name-apple }’s { -brand-name-test-flight } program. Install now!
am: ለ{ -brand-name-apple } በ{ -brand-name-apple } { -brand-name-test-flight } ፕሮግራም በኩል ለ{ -brand-name-ios } በቅድመ-ልቀት አሳሽ ውስጥ ጥሩ ባህሪያትን ተለማመዱ። አሁን ጫን!

source: Extensions for every interest
am: ቅጥያዎች ለእያንዳንዱ ፍላጎት

source: Fast and Private
am: ፈጣን እና የግል

source: Faster page loading, less memory usage and packed with features, the new { -brand-name-firefox } for { -brand-name-linux } is here.
am: ፈጣን ገጽ መጫን፣ አነስተኛ የማህደረ ትውስታ አጠቃቀም እና በልዩ ባህሪያት የታጨቀ፣ አዲሱ { -brand-name-firefox } ለ{ -brand-name-linux } እዚህ አለ።

source: Faster page loading, less memory usage and packed with features, the new { -brand-name-firefox } for { -brand-name-mac-short } is here.
am: ለ{ -brand-name-mac-short } ፈጣን ገጽ ጫኝ፣ አነስተኛ የማህደረ ትውስታ የሚጠቀም እና በልዩ ባህሪያት የታጨቀ፣ አዲሱ { -brand-name-firefox } እዚህ አለ።

source: Faster page loading, less memory usage and packed with features, the new { -brand-name-firefox } for { -brand-name-windows } is here.
am: ለ{ -brand-name-windows } ፈጣን ገጽ ጫኝ፣ አነስተኛ የማህደረ ትውስታ የሚጠቀም እና በልዩ ባህሪያት የታጨቀ፣ አዲሱ { -brand-name-firefox } እዚህ አለ።

source: Faster page loading, less memory usage and packed with features, the new { -brand-name-firefox } is here.
am: ፈጣን ገጽ መጫን፣ አነስተኛ የማህደረ ትውስታ አጠቃቀም እና በባህሪያት የታጨቀ፣ አዲሱ { -brand-name-firefox } እዚህ አለ።

source: Fast, Private & Free
am: ፈጣን፣ የግል እና ነፃ

source: Fast. Private. Secure
am: ፈጣን። የግል። ደህንነቱ የተጠበቀ

source: Features
am: ባህሪዎች

source: Feedback makes us better. Tell us how we can improve the browser and Developer tools.
am: ግብረመልስ የተሻሉ ያደርገናል። አሳሹን እና የገንቢ መሳሪያዎችን እንዴት ማሻሻል እንደምንችል ይንገሩን።

source: File a bug now
am: ስህተት ፋይል አድርግ

source: Find it all faster
am: ሁሉንም በፍጥነት ያግኙ

source: Find the right ad blocker for you
am: ለእርስዎ ትክክለኛውን የማስታወቂያ ማገጃ ያግኙ

source: Find your best browser for speed, privacy and security.
am: ለርስዎ የሚሻለውን ፈጣን፣ ግላዊ እና አስተማማኝ ድረ-ገፅ ማሰሻ ፈልገው ይምረጡ።

source: Fine-tune animations, alignment and padding.
am: አኒሜሽን፣ አሰላለፍ እና ንጣፍ አስተካክል።

source: Fingerprinter Blocking
am: አሳሽ አሻራ ተከታታይ ማገድ

source: Firefox Browsers
am: የፋየርፎክስ አሳሾች

source: Firefox Relay
am: ፋየርፎክስ ቅብብል

source: Firefox Translations
am: የፋየርፎክስ ትርጉሞች

source: Form autofill
am: ቅጽ ራስ-ሙላ

source: Free – In { -brand-name-google-play }
am: ነፃ - በ{ -brand-name-google-play } ውስጥ
